class MenuView(object):

    @staticmethod
    def greeting():
        print("--------------------------------------------------------------")
        print("Добро пожаловать в ЗАМЕТКИ !")
        print("--------------------------------------------------------------")
    @staticmethod
    def goodbye():
        print("--------------------------------------------------------------")
        print("Приложение закрыто")
        print("--------------------------------------------------------------")

    @staticmethod
    def mistake():
        print("--------------------------------------------------------------")
        print("Ошибка ввода команды !")
        print("--------------------------------------------------------------")

    @staticmethod
    def decorator():
        print("--------------------------------------------------------------")